////////////////////Асинхронность///////////////////////

//////////////Синхронный и асинхронный код в JavaScript/////////////////////
/*
console.log('1');
console.log('2');

Очевидно, что сначала сработает первый вывод в консоль, а потом - второй. To есть команды нашего кода выполняются по очереди - в порядке их следования в коде. Такой код называется синхронным. 

 Рассмотрим теперь следующий код:
setTimeout(function() {
	console.log('1');
}, 3000);

console.log('2');

В данном случае команды не выполняются в порядке следования в коде: первый вывод в консоль выполнится, когда приходит его время, но остальной код не ожидает этого момента, а продолжает выполнятся. Такой код называется асинхронным.

Асинхронный код возникает в JavaScript достаточно часто: при работе с таймерами, при привязке обработчиков событий, при загрузке картинок, при работе с технологией AJAX, позволяющей загружать части страницы с сервера, при работе с NodeJS, представляющим собой серверный JavaScript. 
*/




//////////////////////////Асинхронность событийной модели в JavaScript///////////////

/*
 Вы знаете, что с помощью метода addEventListener можно подписаться на различные события, возникающие в элементах страницы. К примеру, подпишемся на клик по некоторому элементу, ссылка на который хранится в переменной elem:
elem.addEventListener('click', function() {
	console.log('1');
});

console.log('2');

В приведенном коде сначала выполнится второй вывод в консоль. Когда же выполнится первый? Когда-то: выполнение этого кода ожидает случившегося события - клика на элемент. Как только это произойдет, так наш код и выполнится.


*/

/*
elem1.addEventListener('click', function() {
	console.log('1');
});
elem2.addEventListener('click', function() {
	console.log('2');
});

Расскажите, в каком порядке выведутся числа в консоль: 
*/

//Ответ: смотря где произошел клик тот первый и выведется в случае если элементы независимы. Если элементы вложены то, кликая на элемент 2 , сработает всплытие





//////////////Асинхронность загрузки картинок в JavaScript////////////////////////
/*
у тега img существует событие load, которое срабатывает при окончании загрузки картинки

Мы можем использовать это, чтобы разместить картинку на странице, только когда эта картинка будет загружена: 

let image = document.createElement('img');
image.src = 'img.png';

image.addEventListener('load', function() {
	document.body.appendChild(image); // размещаем по загрузке
});

Картинка не обязательно загрузится: может быть такое, что путь к картинке неверный, либо произойдет обрыв интернета, поломка сервера с сайтом или что-то подобное. Говоря другими словами - исключительная ситуация. В этом случае сработает не событие load, а событие error:
let image = document.createElement('img');
image.src = 'img.png';

image.addEventListener('load', function() {
	document.body.appendChild(image);
});
image.addEventListener('error', function() {
	// ошибка загрузки картинки
});


*/

/*
Сделайте кнопку, по нажатию на которую будет загружаться картинка. Покажите картинку, когда она будет загружена. Выведите сообщение в случае проблем с загрузкой картинки. 

   <button>загрузить</button>
*/
// let button = document.querySelector('button');

// let image  = document.createElement('img');

// image.addEventListener('load', function() {
//   document.body.appendChild(image);
// });
// image.addEventListener('error', function() {
//   console.log('Ошибка загрузки картинки');
// });
// button.addEventListener('click', function() {
//   image.src = 'smol.webp';
// });
  



///////////////Исключения в асинхронном коде в JavaScript//////////////////////

/*
 Исключение, возникшее внутри асинхронного кода, не может быть поймано через try-catch:
try {
	setTimeout(function() {
		throw(new Error); // исключение не будет поймано
	}, 3000);
} catch(error) {
	console.log(error);
}

*/

/*
 Расскажите, в чем проблема следующего кода:
try {
	elem.addEventListener('click', function() {
		JSON.parse('some string');
	});
} catch() {
	console.log('некорректный json');
}

*/
// try {
// 	elem.addEventListener('click', function() {
// 		JSON.parse('some string');
// 	});
// } catch(error) {
// 	console.log('некорректный json');
// }
//Внутри асинхронрного кода в данносм случае событье клика исключение не поймается