////////////Работа с рекурсией в JavaScript////////////////

/*
let i = 1;

function func(){
	console.log(i);
	i++;
	
	if (i <= 10){
		func(); // здесь функция вызывает сама себя
	}
}
func();
Давайте обсудим, как работает этот код.

У нас есть глобальная переменная i и функция func, внутри которой в консоль выводится содержимое переменной i, а затем делается ++.

Если наша переменная i меньше или равна 10, то функция вызывается повторно. Так как переменная i - глобальная, то при каждом новом вызове функции в ней будет заданное при предыдущем вызове значение переменной i.

Получится, что функция будет вызывать сама себя до тех пор, пока i не станет больше 10.

Учтите, что в нашем случае нельзя функцию запустить без if - если это сделать, то получится бесконечный вызов функций.
*/




// function func(arr) {
// 	console.log(arr.shift(), arr);
	
// 	if (arr.length != 0) {
// 		func(arr);
// 	}
// }

// func([1, 2, 3]);

/*
Дан массив:

let arr = [1, 2, 3, 4, 5];
С помощью рекурсии выведите элементы этого массива в консоль.
*/

// function func(arr) {
// 	console.log(arr.shift()); // выведет 1
// 	console.log(arr); // выведет [2, 3] - массив уменьшился
	
// 	console.log(arr.shift()); // выведет 2
// 	console.log(arr); // выведет [3] - массив уменьшился
	
// 	console.log(arr.shift()); // выведет 3
// 	console.log(arr); // выведет [] - массив пуст
// }

// func([1, 2, 3]);

// function func(arr) {
// 	console.log(arr.shift(), arr);
	
// 	if (arr.length != 0) {
// 		func(arr);
// 	}
// }

// func([1, 2, 3]);

/*
   Дан массив:

let arr = [1, 2, 3, 4, 5];
С помощью рекурсии выведите элементы этого массива в консоль.
*/

// let arr = [1, 2, 3, 4, 5];

// function func(myArr) {
//   // 1. СТОП-КРАН (Базовый случай)
//   // Если мы этого не напишем, функция будет вызывать себя вечно
//  if(myArr.length === 0) {
//    return; // Останавливаемся
//  }

//  // 2. ДЕЙСТВИЕ
//  console.log(myArr[0]);// Печатаем самый первый элемент текущего массива 

//   // 3. РЕКУРСИВНЫЙ ШАГ
//   // Вызываем функцию СНОВА, но передаем массив БЕЗ первого элемента
//   func(myArr.slice(1));
// }
// func(arr);

// let arr = [1, 2, 3, 4, 5];




// function sum(array) {
//   // 1. Если массив пустой, что нужно вернуть?
//   if (array.length === 0) {
//     return 0;
//   }

//   // 2. Возвращаем ПЕРВЫЙ элемент + вызываем функцию для ОСТАТКА массива
//   return array[0] + sum(array.slice(1));
// }

// console.log(sum(arr)); // Должно вывести 15


// let arr = [1, 2, 3, 4, 5];

// function func(arrAy) {
//    if(arrAy.length === 0) {
//       return 0;
//    }

//    return func(arrAy.slice(1))+ 1;
// }

// console.log(func(arr));


// let arr = [1, 2, 3, 4, 5];

// function reversePrint(array) {
//   if (array.length === 0) return;

//   // 1. Сначала уходим вглубь до самого конца...
//   reversePrint(array.slice(1));

//   // 2. ...и только при «схлопывании» рекурсии печатаем
//   console.log(array[0]);
// }

// reversePrint(arr); 
// // Выведет: 5, 4, 3, 2, 1

// let  arr = [1, 2, 3];
// function func(arr) {
//    console.log(arr.shift(), arr);
 
//    if(arr.length != 0) {
//      func(arr);
//    }
    
// }

// func(arr);

////Сумма элементов массива при рекурсии в JavaScript////////


/*
   Дан массив:

let arr = [1, 2, 3, 4, 5];
С помощью рекурсии найдите сумму квадратов элементов этого массива.
*/

// let arr = [1, 2, 3, 4, 5];

// function func() {
//    let sum = arr.shift();

//    if(arr.length !== 0) {
//       sum += func(arr) * 2;
//    }
//    return sum;
// }

// console.log(func(arr));

/////////////Рекурсия и многомерные структуры в JavaScript///

// function func(arr) {
// 	for (let elem of arr) {
// 		if (typeof elem == 'object') {
// 			func(elem);
// 		} else {
// 			console.log(elem);
// 		}
// 	}
// }

// func([1, [2, 7, 8], [3, 4, [5, [6, 7]]]]);


/*
   Дан многомерный объект произвольного уровня вложенности, например, такой:

{a: 1, b: {c: 2, d: 3, e: 4}, f: {g: 5, j: 6, k: {l: 7, m: {n: 8, o: 9}}}}
С помощью рекурсии выведите все примитивные элементы этого объекта в консоль.
*/

//С помощью рекурсии выведите все примитивные элементы этого объекта в консоль.
// function func(obj) {
//    for(let elem in obj) {
//       if(typeof obj[elem] == 'object') {
//          func(obj[elem]);
//       } else {
//          console.log(obj[elem]);
//       }
//    }
// }
// func({a: 1, b: {c: 2, d: 3, e: 4}, f: {g: 5, j: 6, k: {l: 7, m: {n: 8, o: 9}}}});


/*
   Дан многомерный массив произвольного уровня вложенности, например, такой:

   [1, [2, 7, 8], [3, 4, [5, [6, 7]]]]
   Напишите код, который развернет наш многомерный массив в одномерный. Для приведенного выше массива это будет выглядеть вот так:

   [1, 2, 7, 8, 3, 4, 5, 6, 7]
*/
//Напишите код, который развернет наш многомерный массив в одномерный. Для приведенного выше массива это будет выглядеть вот так:

// let result = [];

// function func(arr) {

//    for(let elem of arr) {  
//       if(typeof elem == 'object') {
//          func(elem);
//       } else {
//          result.push(elem);
//       }
//    }
// }
// let arr1 =  [1, [2, 7, 8], [3, 4, [5, [6, 7]]]];
// func(arr1);
// console.log(result);

/////////////Сумма элементов массива через рекурсию в JavaScript////////////////



/*
Дан многомерный объект произвольного уровня вложенности, например, такой:

{a: 1, b: {c: 2, d: 3, e: 4}, f: {g: 5, j: 6, k: {l: 7, m: {n: 8, o: 9}}}}
С помощью рекурсии найдите сумму элементов этого объекта.
*/

// function func(obj) {
//    let sum = 0;

//    for(let key in obj) {
//       if(typeof obj[key] == 'object') {
//          sum += func(obj[key]);
//       } else {
//          sum += obj[key];
//       }
//    }
//    return sum;
// }

// console.log(func({a: 1, b: {c: 2, d: 3, e: 4}, f: {g: 5, j: 6, k: {l: 7, m: {n: 8, o: 9}}}}));


/*
   Дан многомерный массив произвольного уровня вложенности, содержащий внутри себя строки, например, такой:

   ['a', ['b', 'c', 'd'], ['e', 'f', ['g', ['j', 'k']]]]
   С помощью рекурсии слейте элементы этого массива в одну строку:

   'abcdefgjk'
*/

// let result = '';
// function func(arr) {

//    for(let elem of arr) {
//       if(typeof elem == 'object') {
//          func(elem);
//       } else {
//          result += elem;
//       }
//    }
// }


// let res = ['a', ['b', 'c', 'd'], ['e', 'f', ['g', ['j', 'k']]]];
// func(res);

// console.log(result);

///////////Манипуляции с элементами в JavaScript//////////////////

/*
   Дан многомерный массив произвольного уровня вложенности, например, такой:

   [1, [2, 7, 8], [3, 4], [5, [6, 7]]]
   Возведите все элементы-числа этого массива в квадрат.
*/
 
// function func(arr) {
//    let result = [];
//    for(let elem of arr) {
//       if(typeof elem == 'object') {
//         result.push(func(elem));
//       } else {
//          result.push(elem ** 2);
//       }
//    }
//    return result;
// }

// let data = [1, [2, 7, 8], [3, 4], [5, [6, 7]]];

// console.log(func(data));
