///////////////////////////Коллекции Set//////////////////////

/*
Создайте коллекцию Set. С помощью метода add добавьте в нее элементы. Убедитесь, что дубли элементов не добавляются. 
*/
// let set = new Set;

// set.add(2);
// set.add(2);
// set.add(2);
// console.log(set.size)

//////////////Начальное заполнение коллекции Set в JavaScript/////

/*
 Дан массив с числами:
let arr = [1, 2, 3, 1, 3, 4];

С помощью этого массива создайте коллекцию Set. 
*/
// let arr = [1, 2, 3, 1, 3, 4];

// let set = new Set(arr);
// console.log(set);


/* 
Создайте коллекцию Set с начальными значениями 1, 2 и 3. С помощью метода add добавьте в коллекцию еще одно число 2. Выведите содержимое коллекции в консоль, убедитесь, что число 2 не добавилось второй раз. 
*/

// let set = new Set('svetlana');
// set.add('2');
// console.log(set);


////////////Полезные возможности коллекций Set////////////////
/*
 Коллекции Set имеют ряд полезных свойств и методов. Давайте их разберем.
Размер коллекции

В свойстве size содержится размер коллекции:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

console.log(set.size);
Проверка наличия значения

Проверить наличие значения в коллекции можно с помощью метода has:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

console.log(set.has(1));
Удаление элементов

Удалить элемент из коллекции можно с помощью метода delete:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

set.delete(1);
Очистка коллекции

Очистить всю коллекцию можно с помощью метода clear:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

set.clear();

*/