///////////////////////////Коллекции Set//////////////////////

/*
Создайте коллекцию Set. С помощью метода add добавьте в нее элементы. Убедитесь, что дубли элементов не добавляются. 
*/
// let set = new Set;

// set.add(2);
// set.add(2);
// set.add(2);
// console.log(set.size)

//////////////Начальное заполнение коллекции Set в JavaScript/////

/*
 Дан массив с числами:
let arr = [1, 2, 3, 1, 3, 4];

С помощью этого массива создайте коллекцию Set. 
*/
// let arr = [1, 2, 3, 1, 3, 4];

// let set = new Set(arr);
// console.log(set.size);


/* 
Создайте коллекцию Set с начальными значениями 1, 2 и 3. С помощью метода add добавьте в коллекцию еще одно число 2. Выведите содержимое коллекции в консоль, убедитесь, что число 2 не добавилось второй раз. 
*/

// let set = new Set('svetlana');
// set.add('2');
// console.log(set);


////////////Полезные возможности коллекций Set////////////////
/*
 Коллекции Set имеют ряд полезных свойств и методов. Давайте их разберем.
Размер коллекции

В свойстве size содержится размер коллекции:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

console.log(set.size);
Проверка наличия значения

Проверить наличие значения в коллекции можно с помощью метода has:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

console.log(set.has(1));

Удаление элементов

Удалить элемент из коллекции можно с помощью метода delete:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

set.delete(1);
Очистка коллекции

Очистить всю коллекцию можно с помощью метода clear:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

set.clear();
*/


/*
Создайте коллекцию Set с начальными значениями 1, 2 и 3. Выведите на экран количество элементов в коллекции. 
*/
// let arr = [1, 2, 3];
// let set = new Set(arr);
// console.log(set.size);

/*
Создайте коллекцию Set с начальными значениями 1, 2 и 3. Проверьте наличие в коллекции элемента со значением 3, а затем элемента со значением 4. 
*/

// let set = new Set;
// set.add(1);
// set.add(2);
// set.add(3);

// console.log(set.has(3));
// console.log(set.has(4));




//////////Перебор коллекций Set циклом//////////////////////

/*
 Пусть у нас есть некоторая коллекция Set:
let set = new Set;

set.add(1);
set.add(2);
set.add(3);

Давайте переберем ее циклом:
for (let elem of set) {
	console.log(elem);
}

*/

/*
Создайте коллекцию Set с какими-нибудь числами. Переберите эту коллекцию циклом и найдите сумму ее элементов. 
*/

// let set = new Set();

// set.add(5);
// set.add(1);
// set.add('Svetlana');
// set.add('Yura');

// for(let elem of set) {
//    console.log(elem);
// }






/////////////Преобразование коллекций Set///////////////

/*

Преобразование коллекций Set

Коллекции Set можно преобразовывать в массивы. Можно также выполнять обратную операцию - массивы преобразовывать в Set. Давайте посмотрим, как это делается.
Преобразование в массив

Пусть у нас есть некоторая коллекция Set:
let set = new Set([1, 2, 3]);

Можно преобразовать ее в массив, используя прием с деструктуриацией:
let arr = [...set];

А можно воспользоваться методом Array.from:
let arr = Array.from(set);

*/

/*
Дана коллекция Set. Преобразуйте ее в массив двумя описанными способами. 
*/

// let set = new Set([1, 2, 3]);

// let arr = [...set];

// console.log(arr);

/////////////////////////

// let arr = Array.from(set);

// console.log(arr);




/*
          Преобразование массива в Set

Пусть у нас есть массив:
let arr = [1, 2, 3];

Давайте преобразуем его в коллекцию Set:
let set = new Set(arr);

*/

// let arr = [1, 2, 3];

// let set = new Set(arr);

// console.log(set);




//////////////Удаление дублей из массива через Set/////////////

/*
 С помощью коллекций Set легко можно удалять дубли из массивов. Для этого массив нужно преобразовать в коллекцию Set. Так как эта коллекция не может содержать дубли элементов, то при преобразовании они исчезнут. Если затем преобразовать коллекцию обратно в массив, то мы получим массив без дублей.

Давайте посмотрим на примере. Пусть у нас есть следующий массив с дублями:
let arr = [1, 2, 3, 1, 3, 4];

Создадим на его основе коллекцию Set:
let set = new Set(arr);

А теперь преобразуем нашу коллекцию обратно в массив:
let arr = [1, 2, 3, 1, 3, 4];
let res = [...new Set(arr)];

console.log(res); // выведет [1, 2, 3, 4]
*/

/*
Напишите функцию, которая параметром будет принимать массив и возвращать этот массив без дублей. 
*/

// let arr =[1, 5, 1, 5, 5, 5];


// function func(arrey) {
//    //переобразуем наш массив
//    return [...new Set(arrey)];
// }
// let res = func(arr);
// console.log(res);



////////////////Получение DOM элементов без дублей//////////////

/*
Даны абзацы и кнопка. Пользователь кликает на эти абзацы в произвольном порядке. Сделайте так, чтобы по нажатию на кнопку в конец каждого абзаца, на который был совершен клик, был добавлен восклицательный знак. 

   <p>more</p>
   <p>palmy</p>
   <p>veter</p>
   <p>sneg</p>
   <p>reka</p>
   <p>solnce</p>
   <button>кнопка</button>
*/
// let button = document.querySelector('button');
// let elems = document.querySelectorAll('p');
// let set = new Set;

// //переберем обзацы циклом и повесим на них обрботчик
// for(let elem of elems) {
//    elem.addEventListener('click', function() {
//       //по клику на абзац, будем добавлять наш обзац в коллекцию
//       set.add(this);
//    });
// }
// //Из-за того, что мы используем коллекцию Set повторный клик на абзац не будет приводить к добавлению дубля абзаца. 

// //Давайте теперь по клику на кнопку переберем содержимое нашей коллекции и каждому абзацу в конец добавим восклицательный знак: 

// button.addEventListener('click', function() {
//    for(let elem of set) {
//       elem.textContent = elem.textContent + '!';
//    }
// });

