/////////////////////////Символы////////////////////////////////////
////////////Введение в тип Symbol в JavaScript///////////////////////

/*
 Тип Symbol предназначен для создания уникальных идентификаторов. Эти идентификаторы могут быть использованы для создания уникальных ключей объектов.

Давайте для примера создадим символ:
let sym = Symbol();
console.log(sym);

Можно создать несколько символов:
let sym1 = Symbol();
let sym2 = Symbol();

console.log(sym1, sym2);

Созданные нами символы будут уникальными. Это значит, что при сравнении они не будут равны:
let sym1 = Symbol();
let sym2 = Symbol();

console.log(sym1 === sym2); // false
*/

//Создайте несколько символов. 

// let sym1 = Symbol();
// let sym2 = Symbol();
// console.log(sym1, sym2);



/////////////////////Описания символа в JavaScript//////////////////
/*
 Символам можно добавлять описания. Эти описания ни на что не влияют, просто являются подсказкой о том, что содержится в символе:
let sym = Symbol('текстовое описание');
console.log(sym);

*/

//Создайте несколько символов, добавив им описания. 

// let sym1 = Symbol("Описывает первый символ");
// let sym2 = Symbol("Описыветвторой символ");
// let sym3 = Symbol('Описывает третий символ');
// console.log(sym1,sym2, sym3);



////////////////Символы ключи объектов в JavaScript//////////////////

/*
 Давайте для какого-нибудь объекта добавим ключ с типом Symbol. Пусть для примера у нас есть следующий объект:
let obj = {a: 1, b: 2, c: 3};

Добавим в этот объект новый элемент с ключом из символа:
let sym = Symbol();
obj[sym] = 'text';

*/

//Сделайте объект, у которого одним из ключей будет символ. 
//Выведите созданный вами объект в консоль. 

// let obj = {a: 1, b: 2, c: 3, e: 4};
// let sym = Symbol('d:');
// obj[sym] = '8';

// console.log(obj[sym]);



/////////////////Перебор объекта с символами в JavaScript/////////////////

/*
 Преимуществом типа Symbol в качестве ключа объекта является то, что такие ключи не будут участвовать в переборе циклом.

Давайте посмотрим на примере. Пусть у нас есть следующий объект:
let obj = {a: 1, b: 2, c: 3};

Добавим в этот объект новый элемент с ключом из символа:
let sym = Symbol();
obj[sym] = 'text';

Переберем этот объект циклом. В результате мы увидим все элементы, кроме нашего с ключом из символа:
for (let key in obj) {
	console.log(obj[key]); // 1, 2, 3
*/

//Сделайте объект с ключом из символа. Переберите его циклом. Убедитесь, что символ не участвует в переборе. 

// let obj = {a: 1, b: 2, c: 3};

// let sym = Symbol();
// obj[sym] = 'new';


// for(let key in obj) {
//    console.log(obj[key]);
// }



/////////////Функция в объекте в JavaScript///////////////////
/*
 С помощью символов в объекты можно добавлять функции и эти функции не будут участвовать в переборе. Давайте попробуем. Пусть у нас есть объект:
let obj = {a: 1, b: 2, c: 3};

Создадим символ:
let sym = Symbol();

Запишем в объект функцию с ключом в виде нашего символа:
obj[sym] = function() {
	console.log('!!!');
};

При переборе объекта наша функция перебираться не будет:
for (let key in obj) {
	console.log(obj[key]); // 1, 2, 3
}

Получим нашу функцию, в качестве ключа передав наш символ (ту же переменную):
let func = obj[sym];
func();

Можно сократить код:
obj[sym]();

*/

//Добавьте в объект функцию, которая будет выводить текущее время. Вызовите эту функцию. 

// let obj = {a: 1, b: 2, c: 3};

// let sym = Symbol();

// obj[sym] = function() {
//    let data = new Date();
//    console.log(data.getHours() + ':' + data.getMinutes());
// }

// for(let key in obj) {
//    console.log(obj[key]);
// }

// obj[sym]();.





///////////Операции с объектами в функции в JavaScript//////////////

/*

Операции с объектами в функции в JavaScript

Давайте добавим в объект функцию, которая будет выполнять некоторую полезную операцию. Например, будет находить сумму элементов объекта.

Пусть у нас есть объект:
let obj = {a: 1, b: 2, c: 3};

Создадим символ:
let sym = Symbol();

Запишем функцию:
obj[sym] = function() {
	
};

В функции, привязанной к объекту this будет указывать на сам объект:
obj[sym] = function() {
	console.log(this); // {a: 1, b: 2, c: 3}
};

Найдем с помощью нашей функции сумму элементов объекта:
obj[sym] = function() {
	let sum = 0;
	
	for (let key in this) {
		sum += this[key];
	}
	
	return sum;
};

Вызовем нашу функцию, получив сумму элементов объекта:
let sum = obj[sym]();
console.log(sum); // выведет 6

*/

/*
 Дан массив:
let arr = [1, 2, 3];

Описанным в уроке способом добавьте в массив функцию, которая будет возвращать сумму элементов массива. 
*/

//Вызовите созданную функцию и убедитесь, что она верно находит сумму. 

//Добавьте в массив несколько элементов с помощью метода push. Убедитесь, что функция будет находить сумму с учетом новых элементов. 

// let arr = [1, 2, 3,];
// let sym = Symbol();

// arr.push(5, 5, 3); //добавим новые элементы в массив
// arr[sym] = function() {
//    let sum = 0;

//    for(let key in this) {
//       sum += this[key];
//    }
//    return sum;
// }

// let sum = arr[sym]();
// console.log(sum);





////////////////////Глобальные символы в JavaScript/////////////////
/*
Пусть у вас есть несколько объектов. Добавьте каждому из них ключ в виде символа с именем 'sum'. Сделайте в этом ключе функцию, которая будет возвращать сумму элементов объекта. 
*/

// let obj1 = {a: 1, b: 2, c: 3};
// let obj2 = {у: 4, z: 5, x: 6};
// let obj3 = {ay: 1, bz: 8, cx: 9};

// //1. Создаем символ с именем sum
// let sym = Symbol('sum');

// //2. Описываем общую функциюдля подсчета суммы
//  function funcSum() {
//    let sum = 0;
//    for(let key in this) {
//      // Важно: проверяем, что значение — число, 
//      // чтобы случайно не попытаться прибавить саму функцию
//      if(typeof this[key] === 'number') {
//         sum += this[key];
//      }  
//    }
//    return sum;
//  }

//  // 3. Добавляем эту функцию в каждый объект по ключу-символу
//  obj1[sym] = funcSum;
//  obj2[sym] = funcSum;
//  obj3[sym] = funcSum;

//  //4. Проверяем
//  console.log(obj1[sym]());
//  console.log(obj2[sym]());
//  console.log(obj3[sym]());




////////////////Получение имени символа в JavaScript///////////////
/*
 Имея переменную с символом, можно получить его имя в глобальном реестре. Это делается с помощью метода Symbol.keyFor. Давайте попробуем. Создадим символ с именем:

let sym = Symbol.for('test');

Получим его имя по его переменной:
let key = Symbol.keyFor(sym);
console.log(key); // выведет 'test'
*/

/*
 Даны два символа:
let sym1 = Symbol.for('test1');
let sym2 = Symbol.for('test2');

Получите их имена. 
*/
// let sym1 = Symbol.for('test1');
// let sym2 = Symbol.for('test2');

// let key1 = Symbol.keyFor(sym1);
// console.log(key1);

// let key2 = Symbol.keyFor(sym2);
// console.log(key2);





//////////////Хорошо известные символы в JavaScript////////////////////
/*

Хорошо известные символы в JavaScript

Существуют специальные встроенные символы, которые используются JavaScript в служебных целях. Такие символы называются well-known symbols (хорошо известные символы).

Примером такого символа служит Symbol.iterator, содержащий в себе функцию, перебирающую массивы. Проверим ее наличие в каком-нибудь массиве:
let arr = [1, 2, 3];
let func = arr[Symbol.iterator];
console.log(func);

*/

///Сделайте коллекцию Map. Проверьте, есть ли у нее ключ Symbol.iterator.

// let map = new Map();
// let arr = [1];

// map.set(arr, 2);

// let mapFunc = map[Symbol.iterator];
// console.log(mapFunc);// Выведет функцию итератора Map

// console.log(Symbol.iterator in map); // true
// console.log(typeof map[Symbol.iterator]); // "function"


///Сделайте коллекцию Set. Проверьте, есть ли у нее ключ Symbol.iterator. 

// let set = new Set([2, 3, 4]);

// let mySetFanc = set[Symbol.iterator];
// console.log(mySetFanc);

// console.log(Symbol.iterator in set);
// console.log(typeof set[Symbol.iterator]);