
//////Метод map для перебора массива в JavaScrip//////////


/*
Дан массив с числами. Используя метод map извлеките из каждого элемента массива квадратный корень и запишите результат в новый массив.
*/
// let arr = [16, 4, 64, 25, 36];

// let result = arr.map(function(elem) {
//    return Math.sqrt(elem);
// });

// console.log(result);


/*
Дан массив со строками. Используя метод map в конец значению каждого элемента массива добавьте символ '!'.
*/
// let arr = ['mir', 'dom', 'ray', 'yrrra'];

// let ress = arr.map(function(elem) {
//    return elem + '!';
// })

// console.log(ress);



/*
Дан массив со строками. Используя метод map переверните символы каждой строки в обратном порядке.
*/

// let arr = ['sveta', 'sasha', 'Ura', 'Kesha', 'Tosha', 'Acy', 'Timofey'];
// let res = arr.map(function(elem) {
//    return elem.split('').reverse().join('');
// }) ;

// console.log(res);



/*
Дан следующий массив:

let arr = ['123', '456', '789'];
Используя метод map преобразуйте этот массив в следующий:

let arr = [
	[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9]
];
*/



// let arr = ['123', '456', '789'];
// let res = arr.map(function(elem) {
//    return elem.split('').map(Number);
// });
// console.log(res);



/*
Дан массив с числами. Используя метод map запишите в каждый элемент массива значение этого элемента, умноженное на его порядковый номер в массиве.
*/

// let arr = [1, 2, 3, 4, 5];

// let res = arr.map(function(elem, index) {
//    return elem * index;
// });
// console.log(res);


////////Метод forEach для перебора массива в JavaScript//////////

/*
Дан массив с числами. Используя метод forEach найдите сумму квадратов элементов этого массива.
*/

// let arr =[2, 3];
// let sum = 0;

// arr.forEach(function(elem) {
//    sum += elem**2;
// });
// console.log(sum);

//////////Метод filter/////////////////////////



//Дан массив с числами. Оставьте в нем только положительные числа.

// let arr = [1, -2, 3, 9, -7, -4, 87, 5]

// let res = arr.filter(elem => elem >= 0);
// console.log(res);

//Дан массив с числами. Оставьте в нем только отрицательные числа.

// let arr = [2, -1, -7, 3, -9];

// let res = arr.filter(elem => elem <= 0);
// console.log(res);

//Дан массив с числами. Оставьте в нем только числа, которые больше нуля, но меньше 10.

// let arr = [9, -3, -6, 50, 8, -7, 10, 4];

// let res = arr.filter(elem => elem > 0 && elem < 10);
// console.log(res);

//Дан массив со строками. Оставьте в нем только те строки, длина которых больше 5-ти символов.

// let arr = ['Aleks', 'sveta', 'Asy', 'Timofey', 'Tosha'];
// let res = arr.filter(elem => {
//    if(elem.length >= 5) {
//       return elem;
//    }
   
// })
// console.log(res);

//Дан массив с числами. Оставьте в нем только те числа, произведение которых на их порядковый номер меньше 30.
// let arr = [1, 2, 30, 9, 100, 11, 5];

// let res = arr.filter((elem, index) => (elem * index) < 30);
// console.log(res);

//Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только обычные элементы.

// let arr = [1, 2, [3, 4], 5, [6, 7]];

// let res = arr.filter(elem => typeof elem !== 'object');
// console.log(res);

////////////Метод every для проверки массива в JavaScript/////////////


//Дан массив с числами. Проверьте то, что все элементы в массиве больше нуля.

// let arr = [1, -2, 3, 100];
//  let check = arr.every(elem => elem > 0);
//  console.log(check);

//Дан массив с числами. Проверьте то, что для всех элементов произведение их значений на их порядковый номер меньше 30.

// let arr = [3, 5, 3, 1, 2, 2];
// let res = arr.every((elem, index) => (elem * index) < 30);
// console.log(res);


///////////Метод some для проверки массива в JavaScript///////////

//Дан массив с числами. Проверьте то, что в массиве есть хотя бы одно число больше нуля.

// let arr = [2, -3, 4, 6];

// let res = arr.some(elem => elem > 0);
// console.log(res);

//Дан массив с числами. Проверьте то, что хотя бы для одного элемента произведение его значения на порядковый номер больше 30.

// let arr = [11, 3, 10];

// let res = arr.some((elem, index) => (elem * index) < 30 );
// console.log(res);


////////////////////Поиск по массиву через коллбэк на JavaScript///////

///////////////Метод find//////////////

/*
Метод find помогает найти первый элемент в массиве согласно переданному в параметре коллбэку. Если элемента нет, то возвращается undefined.

Давайте найдем элемент массива, соответствующий условиям, прописанным в функции:

let arr = [1, 2, 3, 4];

let res = arr.find(function(currentValue) {
	return currentValue > 0;
});

console.log(res);
Результат выполнения кода:

1
*/

//////////////////////Метод findIndex///////////////////

/*
Метод findIndex позволяет найти индекс первого элемента согласно переданному в параметре коллбэку. Если элемент не найден, то возвращается -1.


Давайте найдем индекс первого четного элемента массива:

let arr = [1, 2, 3, 4, 5];

let res = arr.findIndex(function (elem){
	return elem % 2 == 0;
});

console.log(res);
Результат выполнения кода:

1
*/

//////////////Метод findLast////////////////////

/*Метод findLast ищет первый элемент с конца массива согласно переданному в параметре коллбэку. Если элемента нет, то в результат возвращается undefined.

Давайте найдем элемент массива, соответствующий условиям, прописанным в функции:

let arr = [1, 2, 3, 4, 5];

let res = arr.findLast(function(elem) {
	return elem > 0;
});

console.log(res);
Результат выполнения кода:

5

*/


/////////////////Метод findLastIndex//////////////////////

/*
Метод findLastIndex помогает найти индекс первого элемента с конца массива, соответствующий условию согласно переданному в параметре коллбэку. Если элемента нет, то возвращается -1.

Давайте найдем индекс положительного числа в массиве:

let arr = [-12, -13, 14, 15];

let res = arr.findLastIndex(function(elem) {
	return elem > 0;
});

console.log(res);
Результат выполнения кода:

3


А теперь давайте найдем индекс элемента, которого нет в массиве:

let arr = ['a', 'b', 'c', 'd'];

let res = arr.findLastIndex(function(elem) {
	return elem === 'f';
});

console.log(res);
Результат выполнения кода:

-1

*/



///////////////////////Свертка массива на JavaScript////////////////

////////////Метод reduce///////////////////

/*
Метод reduce сворачивает массив к одному значению (редуцирует). К примеру, с помощью этого метода можно легко найти сумму элементов массива (то есть массив сведется к одному значению - к сумме элементов).

Первым параметром метод reduce получает функцию, которая последовательно выполнится для каждого элемента массива, начиная с первого. В эту функцию можно передавать 4 параметра. Если эти параметры есть (они не обязательны), то в первый автоматически попадет промежуточный результат, во второй попадет элемент массива, в третий - его номер в массиве (индекс), а в четвертый - сам массив.

Промежуточный результат - это переменная, в которой будет накапливаться то значение, которое вернет метод reduce, когда переберет все элементы массива. К примеру, туда последовательно можно накапливать сумму элементов массива: сначала положить первый элемент, при следующем проходе цикла уже сумму первого элемента и второго, при следующем проходе - сумму первого, второго и третьего. И так, пока массив не закончится. Функция, которую принимает reduce, должна возвращать новое значение промежуточного результата.

Вторым параметром метода reduce указывается начальное значение промежуточного результата. Если его не указать, то оно будет равно первому элементу массива, а обработка элементов начнется со второго элемента.

Найдем сумму элементов массива:

let arr = [1, 2, 3, 4, 5, 6];

let res = arr.reduce(function(sum, elem) {
	return sum + elem;
}, 0);

console.log(res);
Результат выполнения кода:

21
/////////////////////////////////////////////////

Давайте найдем сумму всех положительных чисел массива:

let arr = [1, -2, -3, 4, 5, -6];

let res = arr.reduce(function(sum, elem) {
	if (elem >= 0) {
		return sum + elem;
	} else {
		return sum;
	}
}, 0);

console.log(res);

*/

////////////////////////Метод reduceRight///////////////////////////

/*
Метод reduceRight работает точно так же как и reduce - смотрите его для полного понимания. Единственное отличие: reduce перебирает элементы слева направо, а reduceRight - справа налево.

Давайте найдем сумму элементов массива:

let arr = [1, 2, 3, 4, 5, 6];

let res = arr.reduceRight(function(sum, elem) {
	return sum + elem;
}, 0);

console.log(res);
Результат выполнения кода:

21
/////////////////////////////////////////////

Давайте сольем двумерный массив в одномерный:

let arr = [['a', 'b'], ['c'], ['d', 'e']];

let res = arr.reduceRight(function(elem1, elem2) {
	return elem1.concat(elem2);
}, []);

console.log(res);
Результат выполнения кода:

['d', 'e', 'c', 'a', 'b']

*/



/////////////////////////Оператор spread//////////////////////

/*
Дан массив:

let arr = [1, 2, 3, 4, 5];
Дана также функция:

function func(num1, num2, num3, num4, num5) {
	return num1 + num2 + num3 + num4 + num5;
}
Найдите с помощью приведенной функции сумму элементов массива.

*/

// let arr = [1, 2, 3, 4, 5];

// function func(num1, num2, num3, num4, num5) {
// 	return num1 + num2 + num3 + num4 + num5;
// }

// console.log(func(...[1, 2, 3, 4, 5]));


///////////////Использование spread в JavaScript////////////////

// function func(n1, n2, n3, n4, n5, n6, n7, n8) {
// 	return (n1 + n2 + n3 + n4) * (n5 + n6 + n7 + n8);
// }

// console.log( func(1, ...[2, 3, 4], 5, ...[6], ...[7, 8]) );







/////Экстремальные значения массива через spread в JavaScript//////////

//Дан массив с числами. Используя Math.min и spread выведите на экран минимальное значение массива.

// let arr = [10, 2, 30, 4, 5];

// let min = Math.min(...arr);
// console.log(min);







//////////////Оператор spread и слияние массивов////////////////////

/*
let arr1 = [1, 2, 3];
let arr2 = [...arr1, 4, 5, 6];

let arr  = ['a', 'b', 'c', ...arr2];
console.log(arr);

////////////

let arr1 = [1, 2, 3];
let arr2 = [4, 5, 6];

let arr  = ['a', ...arr1, 'b', 'c', ...arr2];
console.log(arr);
*/




//////////////////Оператор spread для строк в JavaScript/////////

/*
Оператор spread, примененный к строке, разбивает эту строку посимвольно:

...'abcde'; // разобьет строку в символы через запятую: 'a','b','c','d','e'
Результат такого разбиения можно передать в параметры функции:

function func(s1, s2, s3, s4, s5) {
	return s1 + '-' + s2 + '-' + s3 + '-' + s4 + '-' + s5;
}

console.log( func(...'abcde') ); // выведет 'a-b-c-d-e'
А можно преобразовать этот результат в массив:

let arr = [...'abcde']; // получим массив ['a', 'b', 'c', 'd', 'e']
*/
// let arr = [...'12345'];
// console.log(arr);

// let arr = ['a', ...'12345'];
// console.log(arr);



/////////////Оператор spread и числа в JavaScript///////////////

/*
Оператор spread не применим к числам:

let arr = [...12345]; // будет ошибка
Для решения проблемы следует преобразовывать число в строку, вот так:

let arr = [...String(12345)]; // получится массив ['1', '2', '3', '4', '5']
*/



/////////////////Оператор rest////////////////////////////////////

///Функция, находящая сумму чисел с помощью операторов rest и spread в JavaScript///////////////////////////////////////////////////////////

// function func(...nums) {
// 	let sum = 0;
	
// 	for (let num of nums) {
// 		sum += num;
// 	}
	
// 	return sum;
// }

// let result = func(1, 2, 3);
// console.log(result); // выведет 6


//Напишите функцию, которая будет принимать параметрами произвольное количество чисел и возвращать их среднее арифметическое.

// function func(...nums) {
//    let sum = 0;
//    for(let num of nums) {
//       sum += num;
//    }
//    return sum / nums.length;
// }
// let result = func(3, 2, 1, 8, 5);
// console.log(result);



////////////////Функция, сливающая массивы в двухмерный в JavaScript///

/*
Давайте сделаем функцию unite, которая параметрами будет принимать произвольное количество массивов и сливать их в один двухмерный.

Вот пример работы описанной функции:

let result = unite([1, 2, 3], [4, 5, 6], [7, 8, 9]);
console.log(result); // выведет [ [1, 2, 3,] [4, 5, 6], [7, 8, 9] ]
Не смотря на достаточную сложность функции, ее реализация с помощью оператора rest будет очень лаконичной:

function unite(...arrs) {
	return arrs;
}
*/




//////////Функция, сливающая массивы в один в JavaScript////////

/*
Давайте теперь реализуем функцию merge, параметрами принимающую произвольное количество массивов и сливающую их элементы в один массив.

Вот пример работы нашей функции:

let result = merge([1, 2, 3], [4, 5, 6], [7, 8, 9]);
console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]
Приступим к реализации. Давайте для начала получим переданные массивы в виде одного двухмерного:

merge([1, 2, 3], [4, 5, 6], [7, 8, 9]);

function merge(...arrs){
	console.log(arrs); // выведет  [ [1, 2, 3,] [4, 5, 6], [7, 8, 9] ]
}
Давайте теперь сольем этот двухмерный массив в одномерный. Используем для этого метод concat и оператор spread:

let arrs   = [ [1, 2, 3,], [4, 5, 6], [7, 8, 9] ];

let result = [].concat(...arrs);
console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]
Давайте добавим этот код в нашу функцию merge:

function merge(...arrs) {
	return [].concat(...arrs);
}

let result = merge([1, 2, 3], [4, 5, 6], [7, 8, 9]);
console.log(result); // выведет [1, 2, 3, 4, 5, 6, 7, 8, 9]
Как вы видите, эта функция также получилась очень лаконичной.
*/

