//25.04.2026
///////////////////////Регулярные выражения//////////////////////////

/////////////////Введение в регулярные выражения///////////////////////////////

/*
Регулярные выражения - это такие команды для сложного поиска и замены (или просто поиска). Они позволяют делать очень интересные вещи, но, к сожалению, довольно тяжелы в освоении. 

 Существует несколько методов JavaScript для работы с регулярными выражениями. Мы начнем знакомится с ними на примере replace - вы уже знакомы с этим методом: он первым параметром принимает что менять, а вторым - на что менять. А сам метод применяется к строке, в которой производится замена:
'bab'.replace('a', '!'); // вернет 'b!b'

 Первым параметром этого метода можно передавать не просто строку, а регулярное выражение. Регулярное выражение представляет собой набор команд, расположенных внутри слешей /. Эти слеши называются ограничителями регулярных выражений.

Сами регулярные выражения состоят из двух типов символов: из тех, которые обозначают сами себя и из символов-команд, которые называются специальные символы.

Буквы и цифры обозначают сами себя. В следующем примере мы с помощью регулярного выражения заменим букву 'a' на !:
'bab'.replace(/a/, '!'); // вернет 'b!b'

 А вот точка является специальным символом и обозначает любой символ. В следующем примере мы найдем строку по такому шаблону: буква 'x', затем любой символ, затем опять буква 'x':
'xax eee'.replace(/x.x/, '!'); // вернет '! eee'

 После ограничителей можно писать модификаторы - команды, которые изменяют общие свойства регулярного выражения. Например, модификатор g включает режим глобального поиска и замены - без него регулярка ищет только первое совпадение, а с ним - все совпадения.

В следующем примере не указан модификатор g и регулярка найдет только первое совпадение:
'aab'.replace(/a/,  '!'); // вернет '!ab'

А теперь регулярка найдет все совпадения:
'aab'.replace(/a/g, '!'); // вернет '!!b'
*/

/*
 Дана строка:
let str = 'ahb acb aeb aeeb adcb axeb';

Напишите регулярку, которая найдет строки 'ahb', 'acb', 'aeb' по шаблону: буква 'a', любой символ, буква 'b'. 
*/
// let str = 'ahb acb aeb aeeb adcb axeb';
// let res = str.replace(/a.b/g, '!');
// console.log(res);

/*
 Дана строка:
let str = 'aba aca aea abba adca abea';

Напишите регулярку, которая найдет строки 'abba', 'adca', 'abea' по шаблону: буква 'a', 2 любых символа, буква 'a'. 
*/
// let str = 'aba aca aea abba adca abea';
// let res = str.replace(/a..a/g, '!');
// console.log(res);

/*
 Дана строка:
let str = 'aba aca aea abba adca abea';

Напишите регулярку, которая найдет строки 'abba' и 'abea', не захватив 'adca'. 
*/
// let str = 'aba aca aea abba adca abea';
// let res = str.replace(/ab.a/g, "!");
//   console.log(res);


//////////////////////Операторы повторения символов в регулярках/////////////////////

/*
 Бывают ситуации, когда мы хотим указать, что символ повторяется заданное количество раз. Если мы знаем точное число повторений, то можно просто написать его несколько раз - /aaaa/. Но что делать, если мы хотим сказать такое: повторить один или более раз?

Для этого существуют операторы (квантификаторы) повторения: плюс + (один и более раз), звездочка * (ноль или более раз) и вопрос ? (ноль или один раз). Эти операторы действуют на тот символ, который стоит перед ними.

Давайте посмотрим на работу этих операторов на примерах. 
*/
/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aba', 'abba', 'abbba' по шаблону: буква 'a', буква 'b' любое количество раз, буква 'a'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab+a/g, '!');
// console.log(res);

/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aa', 'aba', 'abba', 'abbba' по шаблону: буква 'a', буква 'b' любое количество раз (в том числе ниодного раза), буква 'a'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab*a/g, '!');
// console.log(res);


/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aa', 'aba' по шаблону: буква 'a', буква 'b' один раз или ниодного, буква 'a'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab?a/g, '!');
// console.log(res);


/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aa', 'aba', 'abba', 'abbba', не захватив 'abca' и 'abea'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab*a/g, '!');
// console.log(res);

/////////////////Группирующие скобки в регулярках JavaScript/////////////////////
/*
 В предыдущих примерах операторы повторения действовали только на один символ, который стоял перед ними. Что делать, если мы хотим подействовать им на несколько символов?

Для этого существуют группирующие скобки '(' и ')'. Они работают так: если что-то стоит в группирующих скобках и сразу после ')' стоит оператор повторения - он подействует на все, что стоит внутри скобок.

Давайте посмотрим на примерах. 
*/

/*
 Дана строка:
let str = 'ab abab abab abababab abea';

Напишите регулярку, которая найдет строки по шаблону: строка 'ab' повторяется 1 или более раз. 
*/
// let str = 'ab abab abab abababab abea';
// let res = str.replace(/(ab)+/g, '!');
// console.log(res);

/*
Напиши регулярку, которая найдет aba, accca и azza, но не тронет aeb и abba.
(Подсказка: ищи a, потом любой один символ, который повторяется 1 или более раз, и снова a).
*/
// let str = 'aba accca azza aeb abba';
// let res = str.replace(/a.+?a/g, '!');
// console.log(res);