//25.04.2026
///////////////////////Регулярные выражения//////////////////////////

/////////////////Введение в регулярные выражения///////////////////////////////

/*
Регулярные выражения - это такие команды для сложного поиска и замены (или просто поиска). Они позволяют делать очень интересные вещи, но, к сожалению, довольно тяжелы в освоении. 

 Существует несколько методов JavaScript для работы с регулярными выражениями. Мы начнем знакомится с ними на примере replace - вы уже знакомы с этим методом: он первым параметром принимает что менять, а вторым - на что менять. А сам метод применяется к строке, в которой производится замена:
'bab'.replace('a', '!'); // вернет 'b!b'

 Первым параметром этого метода можно передавать не просто строку, а регулярное выражение. Регулярное выражение представляет собой набор команд, расположенных внутри слешей /. Эти слеши называются ограничителями регулярных выражений.

Сами регулярные выражения состоят из двух типов символов: из тех, которые обозначают сами себя и из символов-команд, которые называются специальные символы.

Буквы и цифры обозначают сами себя. В следующем примере мы с помощью регулярного выражения заменим букву 'a' на !:
'bab'.replace(/a/, '!'); // вернет 'b!b'

 А вот точка является специальным символом и обозначает любой символ. В следующем примере мы найдем строку по такому шаблону: буква 'x', затем любой символ, затем опять буква 'x':
'xax eee'.replace(/x.x/, '!'); // вернет '! eee'

 После ограничителей можно писать модификаторы - команды, которые изменяют общие свойства регулярного выражения. Например, модификатор g включает режим глобального поиска и замены - без него регулярка ищет только первое совпадение, а с ним - все совпадения.

В следующем примере не указан модификатор g и регулярка найдет только первое совпадение:
'aab'.replace(/a/,  '!'); // вернет '!ab'

А теперь регулярка найдет все совпадения:
'aab'.replace(/a/g, '!'); // вернет '!!b'
*/

/*
 Дана строка:
let str = 'ahb acb aeb aeeb adcb axeb';

Напишите регулярку, которая найдет строки 'ahb', 'acb', 'aeb' по шаблону: буква 'a', любой символ, буква 'b'. 
*/
// let str = 'ahb acb aeb aeeb adcb axeb';
// let res = str.replace(/a.b/g, '!');
// console.log(res);

/*
 Дана строка:
let str = 'aba aca aea abba adca abea';

Напишите регулярку, которая найдет строки 'abba', 'adca', 'abea' по шаблону: буква 'a', 2 любых символа, буква 'a'. 
*/
// let str = 'aba aca aea abba adca abea';
// let res = str.replace(/a..a/g, '!');
// console.log(res);

/*
 Дана строка:
let str = 'aba aca aea abba adca abea';

Напишите регулярку, которая найдет строки 'abba' и 'abea', не захватив 'adca'. 
*/
// let str = 'aba aca aea abba adca abea';
// let res = str.replace(/ab.a/g, "!");
//   console.log(res);


//////////////////////Операторы повторения символов в регулярках/////////////////////

/*
 Бывают ситуации, когда мы хотим указать, что символ повторяется заданное количество раз. Если мы знаем точное число повторений, то можно просто написать его несколько раз - /aaaa/. Но что делать, если мы хотим сказать такое: повторить один или более раз?

Для этого существуют операторы (квантификаторы) повторения: плюс + (один и более раз), звездочка * (ноль или более раз) и вопрос ? (ноль или один раз). Эти операторы действуют на тот символ, который стоит перед ними.

Давайте посмотрим на работу этих операторов на примерах. 
*/
/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aba', 'abba', 'abbba' по шаблону: буква 'a', буква 'b' любое количество раз, буква 'a'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab+a/g, '!');
// console.log(res);

/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aa', 'aba', 'abba', 'abbba' по шаблону: буква 'a', буква 'b' любое количество раз (в том числе ниодного раза), буква 'a'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab*a/g, '!');
// console.log(res);


/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aa', 'aba' по шаблону: буква 'a', буква 'b' один раз или ниодного, буква 'a'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab?a/g, '!');
// console.log(res);


/*
 Дана строка:
let str = 'aa aba abba abbba abca abea';

Напишите регулярку, которая найдет строки 'aa', 'aba', 'abba', 'abbba', не захватив 'abca' и 'abea'. 
*/
// let str = 'aa aba abba abbba abca abea';
// let res = str.replace(/ab*a/g, '!');
// console.log(res);

/////////////////Группирующие скобки в регулярках JavaScript/////////////////////
/*
 В предыдущих примерах операторы повторения действовали только на один символ, который стоял перед ними. Что делать, если мы хотим подействовать им на несколько символов?

Для этого существуют группирующие скобки '(' и ')'. Они работают так: если что-то стоит в группирующих скобках и сразу после ')' стоит оператор повторения - он подействует на все, что стоит внутри скобок.

Давайте посмотрим на примерах. 
*/

/*
 Дана строка:
let str = 'ab abab abab abababab abea';

Напишите регулярку, которая найдет строки по шаблону: строка 'ab' повторяется 1 или более раз. 
*/
// let str = 'ab abab abab abababab abea';
// let res = str.replace(/(ab)+/g, '!');
// console.log(res);

/*
Напиши регулярку, которая найдет aba, accca и azza, но не тронет aeb и abba.
(Подсказка: ищи a, потом любой один символ, который повторяется 1 или более раз, и снова a).
*/
// let str = 'aba accca azza aeb abba';
// let res = str.replace(/a.+?a/g, '!');
// console.log(res);



///////////Экранировка спецсимволов в регулярках JavaScript///////////////

/*
Предположим, что мы хотим сделать так, чтобы спецсимвол обозначал сам себя. Для этого его нужно экранировать с помощью обратного слеша

Список специальных символов и обычных

Если экранировать обычный символ - ничего страшного не случится - он все равно будет обозначать сам себя. Исключение - цифры, их нельзя экранировать.

Часто возникает сомнение, является ли данный символ специальным. Некоторые доходят до того, что экранируют все подозрительные символы подряд. Однако, это плохая практика (захламляет регулярку обратными слешами).

Являются спецсимволами: $ ^ . * + ? \ / {} [] () |

Не являются спецсимволами: @ : , ' " ; - _ = < > % # ~ `& ! 
*/

/*
 Дана строка:
let str = 'a.a aba aea';

Напишите регулярку, которая найдет строку 'a.a', не захватив остальные. 
*/
// let str = 'a.a aba aea';
// let res = str.replace(/a\.a/, '!');
// console.log(res);

/*
Дана строка:
let str = '2+3 223 2223';

Напишите регулярку, которая найдет строку '2+3', не захватив остальные. 
*/
// let str = '2+3 223 2223';
// let res = str.replace(/2\+3/, '!');
//    console.log(res);

/*
Дана строка:
let str = '23 2+3 2++3 2+++3 345 567';

Напишите регулярку, которая найдет строки '2+3', '2++3', '2+++3', не захватив остальные (+ может быть любое количество). 
*/
// let str = '23 2+3 2++3 2+++3 345 567';
// let res = str.replace(/2(\+)+3/g, '!');
// console.log(res);

/*
Дана строка:
let str = '23 2+3 2++3 2+++3 445 677';

Напишите регулярку, которая найдет строки '23', '2+3', '2++3', '2+++3', не захватив остальные. 
*/
// let str = '23 2+3 2++3 2+++3 445 677';
// let res = str.replace(/2(\+)*3/g, '!');
// console.log(res);


/*
Дана строка:
let str = '*+ *q+ *qq+ *qqq+ *qqq qqq+';

Напишите регулярку, которая найдет строки '*q+', '*qq+', '*qqq+', не захватив остальные. 
*/
// let str = '*+ *q+ *qq+ *qqq+ *qqq qqq+';
// let res = str.replace(/\*(q)+\+/g, '!');
// console.log(res);

/*
Дана строка:
let str = '[abc] {abc} abc (abc) [abc]';

Напишите регулярку, которая найдет строки в квадратных скобках и заменит их на '!'.
*/
// let str = '[abc] {abc} abc (abc) [abc]';
// let res = str.replace(/\[abc\]/g, '!');
// console.log(res);


////////////Фигурные скобки в регулярных выражениях JavaScript/////////
/*
 Операторы '+', '*', '?' хороши, однако, с их помощью нельзя указать конкретное число повторений. В этом случае вам на помощь придет оператор {}.

Работает он следующим образом: {5} - пять повторений, {2,5} – повторяется от двух до пяти (оба включительно), {2,} - повторяется два и более раз. Обратите внимание на то, что такого варианта - {,2} - нет. Посмотрите примеры: 
*/

/*
 Дана строка:
let str = 'aa aba abba abbba abbbba abbbbba';

Напишите регулярку, которая найдет строки 'abba', 'abbba', 'abbbba' и только их. 
*/
// let str = 'aa aba abba abbba abbbba abbbbba';
// let res = str.replace(/ab{2,4}a/g, '!');
//    console.log(res);

/*
Дана строка:
let str = 'aa aba abba abbba abbbba abbbbba';

Напишите регулярку, которая найдет строки вида 'aba', в которых 'b' встречается менее 3-х раз (включительно). 
*/

// let str = 'aa aba abba abbba abbbba abbbbba';
// let res = str.replace(/ab{0,3}a/g, '!');
//    console.log(res);

/*
Дана строка:
let str = 'aa aba abba abbba abbbba abbbbba';

Напишите регулярку, которая найдет строки вида 'aba', в которых 'b' встречается более 4-х раз (включительно). 
*/

// let str = 'aa aba abba abbba abbbba abbbbba';
// let res = str.replace(/ab{4,}a/g, '!');
//    console.log(res);


//////////////////Ограничение жадности в регулярках в JavaScript//////////
/*
Жадность можно ограничивать всем операторам повторения: и *, и ?, и {} - вот так: *?, ?? и {}?. 
*/
/*
 Дана строка:
let str = 'aba accca azzza wwwwa';

Напишите регулярку, которая найдет все строки по краям которых стоят буквы 'a', и заменит каждую из них на '!'. Между буквами 'a' может быть любой символ (кроме 'a'). 
*/
// let str = 'aba accca azzza wwwwa';
// let res = str.replace(/a.+?a/g, "!");
//    console.log(res);





/////////////Группы символов в регулярных выражениях JavaScript//////////
/*
Существуют специальные команды, которые позволяют выбрать сразу целые группы символов

Команда \d означает цифру от 0 до 9. 
 Команда \w обозначает цифру, латинскую букву или знак подчеркивания.
 Команда \s обозначает пробел или пробельный символ: пробел, перевод строки, табуляцию. 
 Можно инвертировать значение команды, написав большую букву: например, если \d - цифра, то \D - не цифра. 
*/

/* 1
 Дана строка:
let str = 'a1a a2a a3a a4a a5a aba aca';

Напишите регулярку, которая найдет строки, в которых по краям стоят буквы 'a', а между ними одна цифра. 
*/

/* 2
 Дана строка:
let str = 'a1a a22a a333a a4444a a55555a aba aca';

Напишите регулярку, которая найдет строки, в которых по краям стоят буквы 'a', а между ними любое количество цифр. 
*/

/* 3 
 Дана строка:
let str = 'aa a1a a22a a333a a4444a a55555a aba aca';

Напишите регулярку, которая найдет строки, в которых по краям стоят буквы 'a', а между ними любое количество цифр (в том числе и ноль цифр, то есть строка 'aa'). 
*/

/* 4
 Дана строка:
let str = 'avb a1b a2b a3b a4b a5b abb acb';

Напишите регулярку, которая найдет строки следующего вида: по краям стоят буквы 'a' и 'b', а между ними - не число и не пробел. 
*/

/* 5
 Дана строка:
let str = 'ave a#b a2b a$b a4b a5b a-b acb';

Напишите регулярку, которая найдет строки следующего вида: по краям стоят буквы 'a' и 'b', а между ними - не буква, не цифра и не пробел. 
*/

/* 6
 Дана строка:
let str = 'ave a#a a2a a$a a4a a5a a-a aca';

Напишите регулярку, которая заменит все пробелы на '!'. 
*/